<img src="ku_logo_uk_v.png" alt="drawing" width="130" style="float:right"/>

# <span style="color:#2c061f"> Week 8 </span>  

<br>

## <span style="color:#374045"> Introduction to Programming and Numerical Analysis </span>


####  <span style="color:#d89216"> <br> Simon Guldager </span>

## Plan for today
<br>

1. Inaugural project feedback
2. Data project 
3. Pandas stuff
4. Split, Apply, Combine

# 1. Inaugural project feedback
Feedback for your project will be via email.  
I will probably only sent an email to one member of every group.

# 2. Data project

The Data project is very open for interpretation. Basically, find a theme, some data and do some Exploratory Data Analysis (EDA). 

Theme inspiration: 
- Danish foreign trade
- Demographic changes
- Covid-19
- Climate & energy 

Whatever you choose the most important thing is to convey a story using data.

# 2.1 Minimum requirements

There will be some minimum requirements for the project. You should show in the project that you can: 
1. Apply data cleaning and data structuring methods
2. Apply data analysis methods
3. Structure a code project
4. Document code
5. Present results in text form and in figures

# 3 Pandas!

Pandas is a really powerful data science library that you likely will encounter a lot. Pandas is built on top of the NumPy package, meaning a lot of the structure of NumPy is used or replicated in Pandas. 

The core element of Pandas is the `DataFrame`. Looks like a 'classic' dataset and can store heterogeneous tabular data. The `DataFrame` is a `Class` with many methods!  Let's import packages:

In [1]:
import pandas as pd
import numpy as np

DataFrames can be loaded from pre-existing data (CSV, Excel, STATA, SAS, HTML, txt etc.) or from list and dictionaries:

In [20]:
np.random.seed(666)
N = 50
log_dist = np.exp(np.random.normal(size=N))

data = {'income':  log_dist * 5, 'rent': log_dist * 2, 'consumption': log_dist * 1.3}

df = pd.DataFrame(data)
df.head(10)

      income      rent  consumption
0  11.400144  4.560058     2.964037
1   8.080097  3.232039     2.100825
2  16.165930  6.466372     4.203142
3  12.409794  4.963918     3.226546
4   2.822764  1.129106     0.733919
5   4.481423  1.792569     1.165170
6   5.096052  2.038421     1.324974
7   1.945807  0.778323     0.505910
8   9.487841  3.795136     2.466839
9   2.277310  0.910924     0.592100

# 3.1 Creating a new variable

In [22]:
df['savings'] = df['income'] - df['rent'] - df['consumption']
df.head(10)

      income      rent  consumption   savings
0  11.400144  4.560058     2.964037  3.876049
1   8.080097  3.232039     2.100825  2.747233
2  16.165930  6.466372     4.203142  5.496416
3  12.409794  4.963918     3.226546  4.219330
4   2.822764  1.129106     0.733919  0.959740
5   4.481423  1.792569     1.165170  1.523684
6   5.096052  2.038421     1.324974  1.732658
7   1.945807  0.778323     0.505910  0.661574
8   9.487841  3.795136     2.466839  3.225866
9   2.277310  0.910924     0.592100  0.774285

# 3.2 Subsetting DataFrame
Sometimes you only need specific parts of a DataFrame. To subset often the `.loc` method is used:

In [37]:
df_sub = df.loc[df["income"] > 10]
df_sub = df_sub.reset_index(drop=True)
df_sub

       income      rent  consumption   savings
0   11.400144  4.560058     2.964037  3.876049
1   16.165930  6.466372     4.203142  5.496416
2   12.409794  4.963918     3.226546  4.219330
3   13.298619  5.319447     3.457641  4.521530
4   11.635614  4.654245     3.025260  3.956109
5   11.732226  4.692891     3.050379  3.988957
6   18.542690  7.417076     4.821099  6.304515
7   23.412768  9.365107     6.087320  7.960341
8   12.262681  4.905073     3.188297  4.169312
9   15.183413  6.073365     3.947687  5.162360
10  21.267349  8.506939     5.529511  7.230899

In [36]:
I = df["income"] > 10
df_sub = df.loc[I]
df_sub = df_sub.reset_index(drop=True)
df_sub

# 3.3  Accessing columns
Many ways to access columns:

In [41]:
#df_sub = df["income"]
#df_sub = df.income
#df_sub = df.loc[:,["income"]]
#df_sub = df.iloc[:,0]
df_sub

       income      rent  consumption   savings
0   11.400144  4.560058     2.964037  3.876049
1   16.165930  6.466372     4.203142  5.496416
2   12.409794  4.963918     3.226546  4.219330
3   13.298619  5.319447     3.457641  4.521530
4   11.635614  4.654245     3.025260  3.956109
5   11.732226  4.692891     3.050379  3.988957
6   18.542690  7.417076     4.821099  6.304515
7   23.412768  9.365107     6.087320  7.960341
8   12.262681  4.905073     3.188297  4.169312
9   15.183413  6.073365     3.947687  5.162360
10  21.267349  8.506939     5.529511  7.230899

# 3.4 More subsetting 
Only want specific columns? Provide a list of column names:

In [47]:
df_sub = df.loc[:, ["income","rent"]]
df_sub = df_sub.reset_index(drop=True)
df_sub = df.loc[I, ["income","rent"]]
df_sub.head(10)

       income      rent
0   11.400144  4.560058
2   16.165930  6.466372
3   12.409794  4.963918
12  13.298619  5.319447
21  11.635614  4.654245
23  11.732226  4.692891
25  18.542690  7.417076
26  23.412768  9.365107
38  12.262681  4.905073
41  15.183413  6.073365

# 4. Split-apply-combine
Walkthrough of a piece of code you will see in the problem set

In [1]:
import pydst
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('seaborn-whitegrid')
import pandas as pd
dst = pydst.Dst(lang='en')

columns_dict = {}
columns_dict['TRANSAKT'] = 'variable'
columns_dict['PRISENHED'] = 'unit'
columns_dict['TID'] = 'year'
columns_dict['INDHOLD'] = 'value'

var_dict = {} # var is for variable
var_dict['P.1 Output'] = 'Y'
var_dict['P.3 Final consumption expenditure'] = 'C'
var_dict['P.3 Government consumption expenditure'] = 'G'
var_dict['P.5 Gross capital formation'] = 'I'
var_dict['P.6 Export of goods and services'] = 'X'
var_dict['P.7 Import of goods and services'] = 'M'

unit_dict = {}
unit_dict['2010-prices, chained values'] = 'real'
unit_dict['Current prices'] = 'nominal'

nah1 = dst.get_data(table_id = 'NAH1', variables={'TRANSAKT':'*', 'PRISENHED':'*', 'TID':'*'})

nah1_true = nah1.copy()
nah1_true.rename(columns=columns_dict,inplace=True)

# c. replace data
for key,value in var_dict.items():
    nah1_true.variable.replace(key,value,inplace=True)

for key,value in unit_dict.items():
    nah1_true.unit.replace(key,value,inplace=True)
    
I = nah1_true["variable"].isin(list(var_dict.values()))
nah1_true = nah1_true.loc[I]

# e. convert values to numeric
nah1_true.value = nah1_true.value.astype('float')

nah = nah1_true.copy()

# split
nah1_true = nah1_true.sort_values(by=['year'], ascending = True)
nah1_true_grouped = nah1_true.groupby(['variable','unit'])
nah1_true_grouped_first = nah1_true_grouped.value.first()
nah1_true_grouped_first.name = 'first'

# b. apply
nah1_true.set_index(['variable','unit','year'],inplace=True)
nah1_true = nah1_true.join(nah1_true_grouped_first,how='left',on=['variable','unit'])
nah1_true.reset_index(inplace=True)

# c. combine
nah1_true['indexed'] = nah1_true['value']/nah1_true['first']

# d. plot
def plot(df):
    df_indexed = df.set_index('year')
    I = df_indexed.unit == 'real'
    df_indexed[I].groupby(['variable'])['indexed'].plot(legend=True);

In [2]:
nah

     variable     unit  year      value
6           Y     real  2016  3490451.0
7           Y  nominal  2016  3646144.0
22          C     real  2016  1436216.0
23          C  nominal  2016  1507957.0
24          G     real  2016   514586.0
...       ...      ...   ...        ...
3335        I  nominal  1992   174815.0
3344        X     real  1992   433602.0
3345        X  nominal  1992   341094.0
3350        M     real  1992   325129.0
3351        M  nominal  1992   277343.0

[672 rows x 4 columns]

## Split

In [3]:
nah = nah.sort_values(by=['year'], ascending = True)
nah_grouped = nah.groupby(['variable','unit']) # nah_groped is a "group element"

# this part is not necesarry it's just for show
num = 0
for i, j in nah_grouped:
    num += 1
    print(i)
    print(j[:5])
    if num > 1:
        break

('C', 'nominal')
     variable     unit  year    value
1643        C  nominal  1966  62576.0
3143        C  nominal  1967  69877.0
1283        C  nominal  1968  77325.0
1343        C  nominal  1969  86753.0
1703        C  nominal  1970  97441.0
('C', 'real')
     variable  unit  year     value
1642        C  real  1966  549491.0
3142        C  real  1967  588094.0
1282        C  real  1968  612327.0
1342        C  real  1969  649337.0
1702        C  real  1970  671805.0

## Apply

In [13]:
nah_grouped_first = nah_grouped.value.first() # takes the first value in the group and creates a data series
nah_grouped_first.name = 'first' # we give the series a name, necesarry for join
nah_grouped_first

variable  unit
C         nominal      62576.0
          real        549491.0
G         nominal      14768.0
          real        171307.0
I         nominal      21134.0
          real        127630.0
M         nominal      24406.0
          real        112171.0
X         nominal      23110.0
          real        123594.0
Y         nominal     144582.0
          real       1089347.0
Name: first, dtype: float64

## Combine

In [5]:
# c. combine
nah.set_index(['variable','unit','year'],inplace=True) # .join needs an index
nah = nah.join(nah_grouped_first, how='left',on=['variable','unit']) # on=['variable','unit']
# nah_grouped_first is joined with nah where variable and unit match variable and unit in the group
nah.reset_index(inplace=True)

nah['indexed'] = nah['value'] / nah['first']
nah

    variable     unit  year      value     first    indexed
0          M  nominal  1966    24406.0   24406.0   1.000000
1          C     real  1966   549491.0  549491.0   1.000000
2          C  nominal  1966    62576.0   62576.0   1.000000
3          G     real  1966   171307.0  171307.0   1.000000
4          G  nominal  1966    14768.0   14768.0   1.000000
..       ...      ...   ...        ...       ...        ...
667        I  nominal  2021   576732.0   21134.0  27.289297
668        X     real  2021  1275485.0  123594.0  10.319959
669        X  nominal  2021  1478926.0   23110.0  63.995067
670        M  nominal  2021  1310530.0   24406.0  53.697042
671        M     real  2021  1160884.0  112171.0  10.349235

[672 rows x 6 columns]

In [11]:
df_indexed = nah.set_index('year')
I = df_indexed.unit == 'real'
df_indexed
#df_indexed[I].groupby(['variable'])['indexed'].plot(legend=True);

     variable     unit      value     first    indexed
year
1966        M  nominal    24406.0   24406.0   1.000000
1966        C     real   549491.0  549491.0   1.000000
1966        C  nominal    62576.0   62576.0   1.000000
1966        G     real   171307.0  171307.0   1.000000
1966        G  nominal    14768.0   14768.0   1.000000
...       ...      ...        ...       ...        ...
2021        I  nominal   576732.0   21134.0  27.289297
2021        X     real  1275485.0  123594.0  10.319959
2021        X  nominal  1478926.0   23110.0  63.995067
2021        M  nominal  1310530.0   24406.0  53.697042
2021        M     real  1160884.0  112171.0  10.349235

[672 rows x 5 columns]

## Usefull resources

Merging guide: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html